🚀&nbsp; env0 had composed a PR Plan for environment [Default Organization Project / output-16568 ](http://dev.dev.env0.com/p/cb9b01ac-6b3f-4f3c-a2dc-05e322089c23/environments/79d49ae0-58a6-4e5f-bcbd-6754c95472cd):
```
Plan: 2 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:


  # aws_vpc.example will be created
+   resource "aws_vpc" "example" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_classiclink                   = (known after apply)
+       enable_classiclink_dns_support       = (known after apply)
+       enable_dns_hostnames                 = (known after apply)
+       enable_dns_support                   = true
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags_all                             = (known after apply)
    }

  # null_resource.null will be created
+   resource "null_resource" "null" {
+       id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named
│ "test_read_only_regression" but a value was found in file
│ "env0.auto.tfvars.json". If you meant to use this value, add a "variable"
│ block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named
│ "test_read_only_regression_free_Text" but a value was found in file
│ "env0.auto.tfvars.json". If you meant to use this value, add a "variable"
│ block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```
</details>


```
Monthly cost change for Wassap124/misc-dev/.env0workdir/.tf-plan
Amount:  $0.00 ($0.00 -> $0.00)

```
<details>
<summary>Cost Estimation Details</summary>

```diff
Project: Wassap124/misc-dev/.env0workdir/.tf-plan

Monthly cost change for Wassap124/misc-dev/.env0workdir/.tf-plan
Amount:  $0.00 ($0.00 -> $0.00)

----------------------------------
Key: ~ changed, + added, - removed

No changes detected. Run infracost breakdown to see the full breakdown.
```
</details>


[Full PR Plan logs on env0](http://dev.dev.env0.com/p/cb9b01ac-6b3f-4f3c-a2dc-05e322089c23/environments/79d49ae0-58a6-4e5f-bcbd-6754c95472cd/deployments/8259a759-51eb-43e0-8427-a01c8dd22fae)